<template>
    <div class="search-wrap">
        <header>
            <div class="top-left-box">
                <router-link to="/">
                    <svg width="24" height="24" viewBox="0 0 1024 1024"><path d="M237.261 586.665l256.14 256.243c11.037 12.569 10.557 31.722-1.44 43.719s-31.15 12.477-43.719 1.44l-1.536-1.44-299.963-299.962h90.517zM491.961 137.373c11.997 11.997 12.477 31.15 1.44 43.719l-1.44 1.536-297.379 297.373h712.085c17.042 0 30.972 13.322 31.946 30.12l0.054 1.88c0 17.042-13.322 30.972-30.12 31.946l-1.88 0.054h-789.333c-27.902 0-42.172-33.017-23.868-53.322l1.24-1.306 352-352c12.497-12.497 32.758-12.497 45.255 0z" fill="#000000" fill-opacity="1"></path></svg>
                </router-link>
            </div>
            <div class="top-search-box">
                <!-- <van-search placeholder="吹风机" shape="round" background="#f0f3f5"/> -->
                <van-search
                v-model="value"
                show-action
                placeholder="吹风机" shape="round" background="#f0f3f5"
                @search="onSearch(value)"
                >
                <template #action>
                    <div @click="onSearch(value)">搜索</div>
                </template>
            </van-search>
            </div>
            <!-- <div class="top-right-box">
                <router-link to="/searchResult">
                    <p>搜索</p>
                </router-link>
            </div> -->
        </header>

        <section>
            <!-- 最近搜索 -->
            <div v-if="hasRecord==1" class="record-wrap">
                <div>
                    <p>最近搜索</p>
                    <svg @click="clearRecord" width="5vw" height="5vw" viewBox="0 0 1024 1024"><path d="M625 42.667c41.237 0 74.667 33.429 74.667 74.667v53.333h249.667c17.673 0 32 14.327 32 32s-14.327 32-32 32h-45.355l-55.272 629.857c-5.801 66.101-61.154 116.81-127.51 116.81h-418.393c-66.356 0-121.709-50.709-127.51-116.81l-55.315-629.857h-45.312c-17.673 0-32-14.327-32-32s14.327-32 32-32h259.421v-53.333c0-41.237 33.429-74.667 74.667-74.667h216.245zM625 106.667h-216.245c-5.891 0-10.667 4.776-10.667 10.667v85.333c0 17.673-14.327 32-32 32h-181.853l54.814 624.262c2.9 33.051 30.577 58.405 63.755 58.405h418.393c33.178 0 60.854-25.354 63.755-58.405l54.707-624.262h-171.992c-17.673 0-32-14.327-32-32v-85.333c0-5.891-4.776-10.667-10.667-10.667zM608 320c17.673 0 32 14.327 32 32v416c0 17.673-14.327 32-32 32s-32-14.327-32-32v-416c0-17.673 14.327-32 32-32zM416 320c17.673 0 32 14.327 32 32v416c0 17.673-14.327 32-32 32s-32-14.327-32-32v-416c0-17.673 14.327-32 32-32z" fill="#000"></path></svg>
                </div>
                <ul>
                    <li v-for="(item,index) in record_list" :key="index" @click="onSearch(item.txt)">
                        {{item.txt}}
                    </li>
                </ul>
            </div>
            <!-- 搜索发现 -->
            <div class="record-wrap">
                <p>搜索发现</p>
                <ul>
                    <li v-for="(item,index) in recomment_list" :key="index" @click="onSearch(item.txt)">
                        {{item.txt}}
                    </li>
                </ul>
            </div>

            <!-- 热搜榜 -->
            <div class="hot-wrap">
                <div class="hot-content-wrap">
                    <div class="hot-title-box">
                        <img src="../assets/img/searchPage-title.png" alt="">
                    </div>
                    <div class="hot-list-wrap">
                        <ul>
                            <li>
                                <div class="left-box">
                                    <img src="../assets/img/searchPage/01-wap.png" alt="">
                                </div>
                                <div class="right-box">
                                    <img src="../assets/img/searchPage/hot-img1.png" alt="">
                                    <p>乐购东莞全国超级补贴！</p>
                                </div>
                            </li>
                            <li>
                                <div class="left-box">
                                    <img src="../assets/img/searchPage/02-wap.png" alt="">
                                </div>
                                <div class="right-box">
                                    <img src="../assets/img/searchPage/hot-img2.png" alt="">
                                    <p>鸿蒙智联 至高享24期免息</p>
                                </div>
                            </li>
                            <li>
                                <div class="left-box">
                                    <img src="../assets/img/searchPage/03-wap.png" alt="">
                                </div>
                                <div class="right-box">
                                    <img src="../assets/img/searchPage/hot-img3.png" alt="">
                                    <p>1分钱锦鲤抽奖，好物大放送！</p>
                                </div>
                            </li>
                            <li>
                                <div class="left-box">
                                    <svg width="6vw" height="6vw" viewBox="0 0 1024 1024"><path d="M605.6 716.8l13.8-92.1h44.1l11.7-78.6h-44.1l39.9-266.1h-101.4l-0.3 0.9-221.7 281.4-3.3 62.4h173.7l-13.8 92.1h101.4zM529.7 546.1h-90.6l-0.6-1.5 95.4-112.2 14.4-22.5 1.8 0.6-20.4 135.6z" fill="#00000066"></path></svg>
                                </div>
                                <div class="right-box">
                                    <img src="../assets/img/searchPage/hot-img4.png" alt="">
                                    <p>企采福利 新用户首单满额赠音箱</p>
                                </div>                       
                            </li>
                            <li>
                                <div class="left-box">
                                    <svg width="6vw" height="6vw" viewBox="0 0 1024 1024"><path d="M489.5 723.1c52.8 0 93.3-13.6 121.5-40.8s45.6-62.6 52.2-106.2c7-47.2 1.55-83.65-16.35-109.35s-47.25-38.15-88.050-37.35c-15.2 0.4-29.4 2.4-42.6 6s-24.3 8.3-33.3 14.1v0l24.6-90.9h173.7l11.7-78.6h-255.9l-61.8 244.8 90 5.1c4.4-8.6 11.35-15.85 20.85-21.75s20.75-8.85 33.75-8.85c18.6 0 31.15 6.7 37.65 20.1s7.95 32.5 4.35 57.3c-3.4 22.4-9.85 39.4-19.35 51s-23.25 17.4-41.25 17.4c-16.4 0-28.75-4.25-37.050-12.75s-11.15-20.75-8.55-36.75v0l-100.5 6.3-0.6 1.5c-6.4 35.6 4.45 64.45 32.55 86.55s62.25 33.15 102.45 33.15z" fill="#00000066"></path></svg>
                                </div>
                                <div class="right-box">
                                    <img src="../assets/img/searchPage/hot-img5.png" alt="">
                                    <p>华为超级新品日 最高优惠1000元</p>
                                </div>      
                            </li>
                            <li>
                                <div class="left-box">
                                    <svg width="6vw" height="6vw" viewBox="0 0 1024 1024"><path d="M491.9 723.1c45.4 0 84.25-13.5 116.55-40.5s51.85-62.8 58.65-107.4c6.4-43 1-78.25-16.2-105.75s-43.7-41.25-79.5-41.25c-20.4 0-38.95 2.85-55.65 8.55s-31.45 13.95-44.25 24.75v0l0.6-3c5-34.4 16.6-60.55 34.8-78.45s39.3-26.85 63.3-26.85c13.2 0 24.75 1 34.65 3s21.55 5.2 34.95 9.6v0l27.9-73.8c-15-6.2-29.050-10.8-42.15-13.8s-27.75-4.5-43.95-4.5c-54.4 0-100.9 15.95-139.5 47.85s-62.3 77.75-71.1 137.55v0l-13.2 87.9c-8.2 54 0.55 96.85 26.25 128.55s61.65 47.55 107.85 47.55zM503.6 645.1c-19 0-32.45-8.1-40.35-24.3s-9.35-40.8-4.35-73.8v0l2.7-18.6c7.2-7.2 16.25-12.8 27.15-16.8s23.35-6 37.35-6c15.2 0 26.45 5.9 33.75 17.7s9.25 29.1 5.85 51.9c-3 19.4-10.45 35.9-22.35 49.5s-25.15 20.4-39.75 20.4z" fill="#00000066"></path></svg>
                                </div>
                                <div class="right-box">
                                    <img src="../assets/img/searchPage/hot-img6.png" alt="">
                                    <p>鸿蒙智联 至高享24期免息</p>
                                </div>       
                            </li>
                            <li>
                                <div class="left-box">
                                    <svg width="6vw" height="6vw" viewBox="0 0 1024 1024"><path d="M522.5 716.8l8.7-57.3c8.8-59.2 25.1-111.050 48.9-155.55s62.8-93.15 117-145.95v0l11.7-78h-315.9l-11.7 78h218.7c-48.6 46-86.85 92.6-114.75 139.8s-46.35 101.1-55.35 161.7v0l-8.7 57.3h101.4z" fill="#00000066"></path></svg>
                                </div>
                                <div class="right-box">
                                    <img src="../assets/img/searchPage/hot-img7.png" alt="">
                                    <p>乐购东莞全国超级补贴！</p>
                                </div> 
                            </li>
                            <li>
                                <div class="left-box">
                                    <svg width="6vw" height="6vw" viewBox="0 0 1024 1024"><path d="M493.1 723.1c46.2 0 85.35-10.95 117.45-32.85s51.35-54.050 57.75-96.45c3.2-22.8-0.7-43.1-11.7-60.9s-27.2-31.9-48.6-42.3c20.2-9.4 36.75-22.3 49.65-38.7s21.050-35.6 24.45-57.6c5.6-38.4-3.25-68.1-26.55-89.1s-55.15-31.5-95.55-31.5c-44 0-80.9 10.1-110.7 30.3s-47.7 50.3-53.7 90.3c-3.2 20.6-0.35 39 8.55 55.2s22.35 29.3 40.35 39.3c-26 9.8-47.35 23.7-64.050 41.7s-26.75 39.1-30.15 63.3c-6.2 40.2 4.7 71.8 32.7 94.8s64.7 34.5 110.1 34.5zM533.9 451.3c-14 0-24.35-4.5-31.050-13.5s-8.75-21.7-6.15-38.1c2-15.2 7.75-27 17.25-35.4s20.95-12.6 34.35-12.6c12.4 0 21.4 4.050 27 12.15s7.3 20.050 5.1 35.85c-2.4 15.6-7.9 28.1-16.5 37.5s-18.6 14.1-30 14.1zM504.8 645.1c-17.8 0-31.65-4.95-41.55-14.85s-13.45-23.85-10.65-41.85c2.6-17.2 10.6-31.35 24-42.45s28.4-16.65 45-16.65c15.8 0 28.050 5.3 36.75 15.9s11.75 25 9.15 43.2c-2.6 17.2-9.9 30.95-21.9 41.25s-25.6 15.45-40.8 15.45z" fill="#00000066"></path></svg>
                                </div>
                                <div class="right-box">
                                    <img src="../assets/img/searchPage/hot-img8.png" alt="">
                                    <p>家电家装  清凉一夏</p>
                                </div>            
                            </li>
                            <li>
                                <div class="left-box">
                                    <svg width="6vw" height="6vw" viewBox="0 0 1024 1024"><path d="M473.6 723.1c47.8 0 89.25-14.7 124.35-44.1s56.65-70.3 64.65-122.7v0l16.5-109.8c8-53.2-0.3-95.3-24.9-126.3s-58.2-46.5-100.8-46.5c-45.4 0-84.4 14.3-117 42.9s-52.2 65.3-58.8 110.1c-6.6 44.4-0.25 80.1 19.050 107.1s48.050 40.5 86.25 40.5c14.8 0 29.15-2.9 43.050-8.7s26.55-14.5 37.95-26.1v0l-3.3 23.7c-3.8 25.4-12.9 45.4-27.3 60s-30.4 21.9-48 21.9c-14.4 0-27.2-1.050-38.4-3.15s-22.8-5.45-34.8-10.050v0l-28.2 72.3c13.6 5.8 28.4 10.4 44.4 13.8s31.1 5.1 45.3 5.1zM516.2 501.4c-16 0-27.15-6.65-33.45-19.95s-7.65-31.55-4.050-54.75c2.8-19.8 10.15-37.25 22.050-52.35s25.45-22.65 40.65-22.65c15.2 0 26.5 6.25 33.9 18.75s9.2 31.65 5.4 57.45v0l-7.2 48.3c-7.4 7.8-16 13.95-25.8 18.45s-20.3 6.75-31.5 6.75z" fill="#00000066"></path></svg>
                                </div>
                                <div class="right-box">
                                    <img src="../assets/img/searchPage/hot-img9.png" alt="">
                                    <p>乐购东莞全国超级补贴！</p>
                                </div> 
                            </li>
                            <li>
                                <div class="left-box">
                                    <svg width="6vw" height="6vw" viewBox="0 0 1024 1024"><path d="M664.3 256c44 0 78.1 14.9 102.3 44.7 22.338 27.508 31.129 64.303 26.372 110.386l-1.472 11.714-17.4 115.8-2.295 13.329c-9.312 47.881-28.497 84.838-57.555 110.871-31.7 28.4-70.65 42.6-116.85 42.6-44.2 0-78.45-14.85-102.75-44.55-22.431-27.415-31.186-64.246-26.265-110.492l1.515-11.758 17.4-115.8 2.247-13.282c9.144-47.72 28.245-84.643 57.303-110.768 31.7-28.5 70.85-42.75 117.45-42.75zM433.8 256l-66.6 443.1h-101.4l52.5-350.1h-87.9l11.7-77.4 191.7-15.6zM652.6 334c-15.6 0-29.050 7.1-40.35 21.3-9.686 12.171-16.616 28.751-20.792 49.739l-1.858 10.861-19.5 129-1.385 10.228c-2.614 23.056-0.902 40.447 5.135 52.172 6.9 13.4 18.65 20.1 35.25 20.1 15.4 0 28.75-7 40.050-21 9.686-12 16.69-28.776 21.012-50.327l1.938-11.173 19.5-129 1.245-10.020c2.308-22.608 0.443-39.818-5.595-51.63-6.9-13.5-18.45-20.25-34.65-20.25z" fill="#00000066"></path></svg>
                                </div>
                                <div class="right-box">
                                    <img src="../assets/img/searchPage/hot-img10.png" alt="">
                                    <p>乐购东莞全国超级补贴！</p>
                                </div>                  
                            </li>
                        </ul >
                    </div>
                </div>
            </div>
        </section>
    </div>
</template>

<style scoped src="../assets/css/search.css">

</style>

<script>
import $ from 'jquery'

export default {
    mounted(){
        if(this.record_list.length>0){
            this.hasRecord=1
        }else{
            this.hasRecord=0;
        }
    },
    data(){
        return{
            value:'',
            hasRecord:1,
            record_list:[
                {
                    txt:'空调'
                },
                {
                    txt:'HarmonyOS 3'
                }
            ],
            recomment_list:[
                {
                    txt:'政府补贴'
                },
                {
                    txt:'HarmonyOS 3'
                },
                {
                    txt:'空调'
                },
                {
                    txt:'平板'
                },
                {
                    txt:'数据线'
                },
                {
                    txt:'畅享50pro'
                },
                {
                    txt:'儿童手表'
                },
                {
                    txt:'打印机'
                },
                {
                    txt:'投影仪'
                },
                {
                    txt:'手环'
                }
            ]
        }
    },
    methods:{
        clearRecord(){
            this.record_list.splice(0,this.record_list.length);
            this.hasRecord=0;
        },
        onSearch(value){
            this.value = value
            this.$router.push({path:"/searchResult",query:{value:value}});
        }
    }
}
</script>